GymManager/app/models/schedule.rb

  def time_not_overlap
    return unless time.present? && date.present?

    start_time = DateTime.new(date.year, date.month, date.day, time.hour, 0, 0)
    end_time = start_time + 1.hour

    if Schedule.where("date = ? AND (time BETWEEN ? AND ?)", date, start_time, end_time).exists?
---
SELECT 1 AS one FROM "schedules" WHERE (date = '2024-04-27' AND (time BETWEEN '2024-04-27 07:00:00' AND '2024-04-27 08:00:00')) LIMIT ?  [["LIMIT", 1]]