GymManager/app/views/users/_user.html.erb

  <div class="w-1/4 bg-blue-100 border border-blue-200 rounded-md p-2">
    <% if user.membership.present? %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]