GymManager/app/views/pages/home.html.erb

          <h2 class="text-lg font-semibold mb-2"><%= date.strftime("%A, %d %B %Y") %></h2>
          <% trainings_for_date = Training.where("start_time >= ? AND start_time <= ?", date.beginning_of_day, date.end_of_day) %>
---
SELECT "trainings".* FROM "trainings" WHERE (start_time >= '2024-04-25 00:00:00' AND start_time <= '2024-04-25 23:59:59.999999')