GymManager/app/views/memberships/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.collection_select :user_id, User.all, :id, :name, prompt: "Wybierz użytkownika" %>
---
SELECT "users".* FROM "users"