GymManager/app/controllers/memberships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "memberships" ("user_id", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["start_date", "2024-04-26"], ["end_date", "2024-05-04"], ["created_at", "2024-04-25 23:40:40.671424"], ["updated_at", "2024-04-25 23:40:40.671424"]]
---
  def create
    user = User.find(membership_params[:user_id])
    if user_has_active_membership?(user)
      redirect_to memberships_path, alert: "Użytkownik już ma aktywne członkostwo."
      return
    end

    @membership = Membership.new(membership_params)

    respond_to do |format|
      if @membership.save

DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 9]]
---
  def destroy
    @membership.destroy!

SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
---
  def user_has_active_membership?(user)
    user.membership.present? && user.membership.end_date.nil?