GymManager/app/controllers/pages_controller.rb

SELECT "schedules".* FROM "schedules" WHERE (date = '2024-04-22') ORDER BY "schedules"."time" ASC
---
  def home
    @week_start = Date.today.beginning_of_week
    @week_end = Date.today.end_of_week
    @days = (@week_start..@week_end).to_a
    @trainings_by_day = {}
    @days.each do |day|
      @trainings_by_day[day] = Schedule.where("date = ?", day).order(:time)