GymManager/app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("training_id", "date", "created_at", "updated_at", "time") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["training_id", 2], ["date", "2024-04-25"], ["created_at", "2024-04-26 00:40:45.986616"], ["updated_at", "2024-04-26 00:40:45.986616"], ["time", nil]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
  def destroy
    @schedule.destroy!