GymManager/app/controllers/trainings_controller.rb

  def index
    @trainings = Training.all
---
SELECT "trainings".* FROM "trainings"

  def create
    @training = Training.new(training_params)

    respond_to do |format|
      if @training.save
---
INSERT INTO "trainings" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Klatka"], ["description", "Trening Klatki piersiowej\n"], ["created_at", "2024-04-25 23:59:10.573578"], ["updated_at", "2024-04-25 23:59:10.573578"]]

  def update
    respond_to do |format|
      if @training.update(training_params)
---
UPDATE "trainings" SET "name" = ?, "updated_at" = ? WHERE "trainings"."id" = ?  [["name", "Trening siłowy"], ["updated_at", "2024-04-26 00:28:19.341386"], ["id", 2]]

  def destroy
    @training.destroy!
---
DELETE FROM "trainings" WHERE "trainings"."id" = ?  [["id", 1]]

    def set_training
      @training = Training.find(params[:id])
---
SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]