GymManager/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Adam"], ["email", "czicza@gmail.com"], ["phone", "123123123"], ["created_at", "2024-04-25 21:54:57.603338"], ["updated_at", "2024-04-25 21:54:57.603338"]]